Repository: pypi-data/pypi-mirror-20
Catalog: packages/gscli/gscli-1.3.1.tar.gz/gscli-1.3.1/gscli/locale/*/LC_MESSAGES/messages.po
Languages: ru

source: A CLI client for GNU Social.
ru: Консольный клиент для GNU Social.

source: command to run
ru: команда для исполнения

source: COMMAND
ru: КОМАНДА

source: show info about specified commands
ru: вывести информацию об указанных командах

source: show available commands
ru: вывести доступные команды

source: Error:
ru: Ошибка:

source: Fetch home timeline.
ru: Получить домашнюю ленту.

source: Fetch public timeline.
ru: Получить публичную ленту.

source: Fetch friends timeline.
ru: Получить дружескую ленту.

source: Fetch user timeline.
ru: Получить пользовательскую ленту.

source: Fetch replies timeline.
ru: Получить ленту с ответами.

source: Delete a status.
ru: Удалить пост.

source: Show the status details.
ru: Показать информацию о посте.

source: Repeat a status.
ru: Повторить пост.

source: Favorite a status.
ru: Добавить пост в избранное.

source: Fetch favorites timeline.
ru: Получить ленту избранного.

source: Follow the user.
ru: Подписаться на обновления пользователя.

source: You have followed {user}.
ru: Вы подписались на обновления {user}.

source: Unfollow the user.
ru: Отписаться от обновлений пользователя.

source: You have unfollowed {user}.
ru: Вы отписались от обновлений {user}.

source: Show your or specified user's followers.
ru: Вывести подписчиков указанного пользователя или вас.

source: Show users who you or specified user are following.
ru: Вывести пользователей, на которых подписаны вы или указанный пользователь.

source: Block a user.
ru: Игнорировать пользователя.

source: You have blocked {user}.
ru: Вы игнорируете {user}.

source: Unblock a user.
ru: Прекратить игнорировать пользователя.

source: You have unblocked {user}.
ru: Вы прекратили игнорировать {user}.

source: Show groups which you or specified user are members of.
ru: Вывести сообщества, членом которых являетесь вы или указанный пользователь.

source: Show users who are the members of the group.
ru: Показать членов сообщества.

source: Fetch group timeline.
ru: Получить ленту сообщества.

source: Join a group.
ru: Вступить в сообщество.

source: You have joined {group}.
ru: Вы вступили в {group}.

source: Leave a group.
ru: Покинуть сообщество.

source: You have left {group}.
ru: Вы покинули {group}.

source: Invalid config:
ru: Ошибки в конфигурационном файле:

source: Enter server URL:
ru: Введите URL сервера:

source: Enter username:
ru: Введите имя пользователя:

source: Enter password:
ru: Введите пароль:

source: Configuration saved in {file}
ru: Конфигурационный файл сохранён в {file}

source: usage:
ru: использование:

source: argument %(argument_name)s: %(message)s
ru: аргумент %(argument_name)s: %(message)s

source: .__call__() not defined
ru: .__call__() не определён

source: unknown parser %(parser_name)r (choices: %(choices)s)
ru: неизвестный парсер %(parser_name)r (варианты: %(choices)s)

source: argument "-" with mode %r
ru: аргмент "-" с режимом %r

source: %(prog)s: error: %(message)s
ru: %(prog)s: ошибка: %(message)s

source: can't open '%s': %s
ru: невозможно открыть '%s': %s

source: cannot merge actions - two groups are named %r
ru: невозможно соединить действия - две группы названы %r

source: 'required' is an invalid argument for positionals
ru: 'required' неверный параметр для обязательных аргументов

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
ru: неверная строка опции %(option)r: должна начинаться с символа %(prefix_chars)r

source: dest= is required for options like %r
ru: dest= требуется для опций наподобие %r

source: invalid conflict_resolution value: %r
ru: неверное значение conflict_resolution: %r

source: mutually exclusive arguments must be optional
ru: взаимоисключающие аргументы должны быть необязательными

source: positional arguments
ru: обязательные параметры

source: optional arguments
ru: необязательные параметры

source: show this help message and exit
ru: показатель это сообщение и выйти

source: cannot have multiple subparser arguments
ru: невозможно использовать несколько аргументов субпарсеров

source: unrecognized arguments: %s
ru: неопознанные аргументы: %s

source: not allowed with argument %s
ru: не разрешен с аргументом %s

source: ignored explicit argument %r
ru: проигнорирован явный аргумент %r

source: the following arguments are required: %s
ru: данные аргументы обязательны: %s

source: one of the arguments %s is required
ru: один из аргументов %s является обязательным

source: expected one argument
ru: ожидает один аргумент

source: expected %s argument
ru: ожидается %s аргумент

source: expected at most one argument
ru: ожидает максимум один аргумент

source: expected at least one argument
ru: ожидает минимум один аргумент

source: ambiguous option: %(option)s could match %(matches)s
ru: неоднозначная опция: %(option)s может подойти к %(matches)s

source: unexpected option string: %s
ru: неожиданная строка параметров: %s

source: %r is not callable
ru: %r не вызываемый

source: invalid %(type)s value: %(value)r
ru: неверное значение типа %(type)s: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
ru: неверный выбор: %(value)r (выберите из %(choices)s)

source: Show all available commands or info about specified commands.
ru: Вывести доступные команды или информацию об указанных командах.

source: Post a status.
ru: Отправить пост.

source: text of the status to post
ru: текст поста для отправки

source: STATUS_TEXT
ru: ТЕКСТ_ПОСТА

source: a file to attach
ru: файл для прикрепления

source: FILE
ru: ФАЙЛ

source: STATUS_ID
ru: ID_ПОСТА

source: ID of the status to reply to
ru: ID поста для ответа

source: Show a conversation.
ru: Показать беседу.

source: Upload files.
ru: Загрузить файлы.

source: files to upload
ru: файлы для загрузки

source: Search statuses matching the query.
ru: Искать посты по запросу.

source: search query
ru: поисковый запрос

source: QUERY
ru: ЗАПРОС

source: PAGE
ru: СТРАНИЦА

source: the page number (starting at 1) to return
ru: номер страницы, начиная с 1

source: the number of notices to return per page, up to a max of 100
ru: количество постов на страницу, максимум: 100

source: USERNAME
ru: ИМЯ_ПОЛЬЗОВАТЕЛЯ

source: USER_ID
ru: ID_ПОЛЬЗОВАТЕЛЯ

source: CONVERSATION_ID
ru: ID_БЕСЕДЫ

source: GROUP_NAME
ru: НАЗВАНИЕ_СООБЩЕСТВА

source: GROUP_ID
ru: ID_СООБЩЕСТВА

source: Number of items to fetch
ru: Количество объектов для получения

source: COUNT
ru: КОЛИЧЕСТВО

source: Name of the target user
ru: Имя указанного пользователя

source: ID of the target user
ru: ID указанного пользователя

source: ID of the conversation to show
ru: ID беседы для вывода

source: ID of the target status
ru: ID указанного поста

source: ID of the target group
ru: ID указанного сообщества

source: Name of the target group
ru: Название указанного сообщества

source: conversation id: {conversation_id} {repeat_block} {fave_block} Posted from: {source} URL: {url}
ru: id беседы: {conversation_id} {repeat_block} {fave_block} Отправлено из: {source} URL: {url}

source: Has not been repeated
ru: Не повторён

source: has been repeated by you
ru: повторён вами

source: has not been repeated by you
ru: не повторён вами

source: Has been repeated by {repeat_num} person ({you})
ru: Повторён {repeat_num} человеком ({you})

source: Has not been favorited
ru: Не добавлен в избранное

source: has been favorited by you
ru: добавлен в изрбанное вами

source: has not been favorited by you
ru: не добавлен в изрбанное вами

source: Has been favorited by {fave_num} person ({you})
ru: Добавлен в изрбанное {fave_num} человеком ({you})

source: Unknown command: '{cmd}'
ru: Неизвестная команда: '{cmd}'

source: Invalid server URL
ru: Неверный URL сервера
