Repository: pypi-data/pypi-mirror-20
Catalog: packages/ishtar/ishtar-0.99.13.tar.gz/ishtar-0.99.13/translations/*/archaeological_context_records.po
Languages: fr

source: Operation
fr: Opération

source: ID
fr: Identifiant

source: Operation's year
fr: Année de l'opération

source: Operation's number (index by year)
fr: Numéro de l'opération (index par année)

source: Archaeological site
fr: Entité archéologique

source: Search within related operations
fr: Rechercher parmi les opérations liées

source: Period
fr: Période

source: Unit type
fr: Type d'unité

source: Parcel (section/number/public domain)
fr: Parcelle (section/numéro/domaine public)

source: Search within relations
fr: Rechercher parmi les relations

source: Context record search
fr: Rechercher une Unité d'Enregistrement

source: You should at least select one context record.
fr: Vous devez sélectionner au moins une Unité d'Enregistrement.

source: General
fr: Général

source: Parcel
fr: Parcelle

source: General comment
fr: Commentaire général

source: Length (m)
fr: Taille (m)

source: Width (m)
fr: Largeur (m)

source: Thickness (m)
fr: Épaisseur (m)

source: Depth (m)
fr: Profondeur (m)

source: Context record type
fr: Type d'Unité d'Enregistrement

source: Has furniture?
fr: Contient du mobilier ?

source: Location
fr: Lieu

source: <p>Heavy images are resized to: %(width)dx%(height)d (ratio is preserved).</p>
fr: <p>Les images trop grandes sont retaillées en : %(width)dx%(height)d (le ratio est conservé).</p>

source: This ID already exists for this operation.
fr: Cet identifiant existe déjà pour cette opération.

source: Dating
fr: Datation

source: Start date
fr: Date de début

source: End date
fr: Date de fin

source: Quality
fr: Qualité

source: Dating type
fr: Type de datation

source: Context record
fr: Unité d'Enregistrement

source: Interpretation
fr: Interprétation

source: Comments on dating
fr: Commentaires sur la datation

source: Filling
fr: Remplissage

source: Activity
fr: Activité

source: Estimated TAQ
fr: TAQ estimé

source: Estimated TPQ
fr: TPQ estimé

source: Operation search
fr: Rechercher une opération

source: You should select an operation.
fr: Vous devez sélectionner une Opération.

source: Would you like to delete this context record?
fr: Voulez-vous supprimer cette Unité d'Enregistrement ?

source: You should select a context record.
fr: Vous devez sélectionner une Unité d'Enregistrement.

source: Year of the operation
fr: Année de l'opération

source: Numeric reference
fr: Référence numérique

source: Town of the operation
fr: Commune de l'opération

source: Period of the context record
fr: Période de l'Unité d'Enregistrement

source: Documentation search
fr: Rechercher une documentation

source: You should select a document.
fr: Vous devez sélectionner un document.

source: Search
fr: Recherche

source: Creation
fr: Ajout

source: Deletion
fr: Suppression

source: Dating types
fr: Types de datation

source: Dating quality type
fr: Type de qualité de datation

source: Dating quality types
fr: Types de qualité de datation

source: Precise dating
fr: Datation précise

source: Datings
fr: Datations

source: Order
fr: Ordre

source: Parent context record type
fr: Type d'UE parent

source: Context record Type
fr: Type d'Unité d'Enregistrement

source: Context record Types
fr: Types d'Unité d'Enregistrement

source: Activity Type
fr: Type d'activité

source: Activity Types
fr: Types d'activité

source: Identification Type
fr: Type d'identification

source: Identification Types
fr: Types d'identification

source: Periods
fr: Périodes

source: Town
fr: Ville

source: Parcel (town)
fr: Parcelle (commune)

source: Related context records
fr: Unités d'Enregistrement liées

source: Parcel (external ID)
fr: Parcelle (identifiant externe)

source: Datings (period)
fr: Datations (période)

source: Parcel (year)
fr: Parcelle (année)

source: External ID
fr: ID externe

source: External ID is set automatically
fr: L'identifiant externe est configuré automatiquement

source: A short description of the location of the context record
fr: Une courte description de la localisation de l'Unité d'Enregistrement

source: Comment on datings
fr: Commentaire sur les datations

source: "Terminus Ante Quem" the context record can't have been created after this date
fr: « Terminus Ante Quem ». L'Unité d'Enregistrement ne peut avoir été créée après cette date.

source: Estimation of a "Terminus Ante Quem"
fr: Estimation d'un « Terminus Ante Quem ».

source: "Terminus Post Quem" the context record can't have been created before this date
fr: « Terminus Post Quem ». L'Unité d'Enregistrement ne peut avoir été créée avant cette date.

source: Estimation of a "Terminus Post Quem"
fr: Estimation d'un « Terminus Post Quem ».

source: Polygon
fr: Polygone

source: Cached name
fr: Nom en cache

source: Context Record
fr: Unité d'Enregistrement

source: Can view all Context Records
fr: Peut voir toutes les Unités d'Enregistrement

source: Can view own Context Record
fr: Peut voir sa propre Unité d'Enregistrement

source: Can add own Context Record
fr: Peut ajouter sa propre Unité d'Enregistrement

source: Can change own Context Record
fr: Peut modifier sa propre Unité d'Enregistrement

source: Can delete own Context Record
fr: Peut supprimer sa propre Unité d'Enregistrement

# short
source: Context record
fr: UE

source: Inverse relation
fr: Relation inverse

source: Relation type
fr: Type de relation

source: Relation types
fr: Types de relation

source: ID (left)
fr: ID (gauche)

source: Context record type (left)
fr: Type d'UE (gauche)

source: Parcel (left)
fr: Parcelle (gauche)

source: Description (left)
fr: Description (gauche)

source: Periods (left)
fr: Périodes (gauche)

source: ID (right)
fr: ID (droit)

source: Context record type (right)
fr: Type d'UE (droite)

source: Parcel (right)
fr: Parcelle (droite)

source: Description (right)
fr: Description (droite)

source: Periods (right)
fr: Périodes (droite)

source: Record relation
fr: Relation entre Unités d'Enregistrement

source: Record relations
fr: Relations entre Unités d'Enregistrement

source: Context record documentation
fr: Documentation d'une Unité d'Enregistrement

source: Context record documentations
fr: Documentations des Unités d'Enregistrement

source: New context record
fr: Ajouter une Unité d'Enregistrement

source: Context record modification
fr: Modifier une Unité d'Enregistrement

source: Context record deletion
fr: Supprimer une Unité d'Enregistrement

source: Context record: source search
fr: Unité d'Enregistrement : rechercher une documentation associée

source: Context record: new source
fr: Unité d'Enregistrement : ajouter une documentation associée

source: Context record: source modification
fr: Unité d'Enregistrement : modifier une documentation associée

source: Context record: source deletion
fr: Unité d'Enregistrement : supprimer une documentation associée

source: Complete ID:
fr: ID complet :

source: Temporary ID:
fr: ID temporaire :

source: Context record relations
fr: Relations entre Unités d'Enregistrement

source: Operation summary
fr: Résumé de l'opération

source: Patriarche OA code not yet recorded!
fr: Code d'opération Patriarche non renseigné !

source: State:
fr: État :

source: Active file
fr: Dossier actif

source: Closed operation
fr: Opération close

source: Closing date:
fr: Date de clôture :

source: by
fr: par

source: Localisation
fr: Lieu

source: Towns:
fr: Communes :

source: Related operation:
fr: Opération associée :

source: No operation linked to this context unit!
fr: Pas d'opération rattachée à cette UE !

source: Document from this context record
fr: Document associé à cette Unité d'Enregistrement

source: Finds
fr: Mobilier

source: Documents from associated finds
fr: Documents du mobilier associé

source: Context record source
fr: Documentation associée à l'UE
