Repository: pypi-data/pypi-mirror-20
Catalog: packages/collective.smsauthenticator/collective.smsauthenticator-0.3.3.zip/collective.smsauthenticator-0.3.3/src/collective/smsauthenticator/locales/*/LC_MESSAGES/collective.smsauthenticator.po
Languages: de

source: (Re)set your two-step verification mobile number
de: Ihre 2-Faktor Authentifizierungsnummer zurücksetzen/setzen

source: (Re)setting of the mobile number failed! {0}
de: Das setzen/zurücksetzen der Handynummer ist fehlgeschlagen! {0}

source: A confirmation SMS message has been sent to the mobile number specified.
de: Eine SMS zur Bestätigung wurde an die spezifizierte Handynummer verschickt.

source: After submitting this form, you will receive an e-mail with a link and a SMS with a code. <br/><br/> To successfully verify your mobile number, open the link from your e-mail in a browser and enter the code from your SMS in the form.
de: Nachdem Sie dieses Formular abgeschickt haben werden Sie eine E-Mail und eine SMS mit einem Code erhalten. <br/><br/> Um Ihre Telefonnummer erfolgreich zu verifizieren müssen Sie den Link aus dem E-Mail in einem Browser öffnen und dort Ihren SMS Code eingeben.

source: All user IPs
de: Alle Benutzer IPs

source: An e-mail has been sent to your e-mailadres with a link to complete your request. <br />Please open the link provided in the e-mail and enter the code received on your mobile phone.
de: Eine E-Mail mit einem Link wurde an Ihre E-Mail Adresse Versand. <br />Bitte öffnen Sie den Link aus der E-Mail und geben Sie den 2-Faktor Authentifizierungscode den Sie am Handy erhalten haben ein.

source: An email with further instructions for (re)setting your mobile number has been sent.
de: Eine E-Mail mit weiteren Anweisungen für das setzen/zurücksetzen Ihrer Handynummer wurde verschickt.

source: An error occured while sending the SMS to the number specified.
de: Während dem Versand der SMS an die spezifizierte Nummer trat ein Fehler auf.

source: Authentication token lifetime in seconds.
de: Authentifizierungstoken Gültigkeitsdauer in Sekunden.

source: Automatically generated
de: Automatisch generiert

source: Automatically generated each time SMS message is sent
de: Jedes mal wenn eine SMS gesendet wird Automatisch generiert.

source: Automatically generated each time user logs in
de: Jedes mal wenn der Benutzer sich anmeldet automatisch generiert

source: Cancel
de: Abbrechen

source: Changes saved.
de: Änderungen gespeichert.

source: Code to reset the mobile number (sent by SMS)
de: Code um die Handynummer zurückzusetzen (Als SMS versand)

source: Complete the two-step verification setup by confirming your mobile number
de: Schliessen Sie die Einrichtung der 2-Faktor Authentifizierung ab indem Sie Ihre Handynummer verifizieren

source: Confirm your login by entering the login code sent to your mobile number by SMS.
de: Bestätigen Sie den Login indem Sie den Code eingeben den Sie per SMS erhalten haben.

source: Date
de: Datum

source: Dear ${username}: You have requested to reset your SMS Authenticator mobile number. Click on this link {mobile_number_reset_url} to reset your mobile number.
de: Hallo ${username}, Sie haben Angefragt Ihre Telefonnummer zu ändern. Klicken Sie auf diesen Link {mobile_number_reset_url} um Ihre Telefonnummer zu ändern. Vielen Dank.a

source: Disable two-step verification
de: 2-Faktor Authentifizierung abschalten

source: Disable two-step verification for all users
de: 2-Faktor Authentifizierung für alle Benutzer abschalten

source: Edit cancelled.
de: Bearbeitung abgebrochen.

source: Enable two-step verification
de: 2-Faktor Authentifizierung einschalten

source: Enable two-step verification for all users
de: 2-Faktor Authentifizierung für alle Benutzer einschalten

source: Enable two-step verification.
de: 2-Faktor Authentifizierung einschalten.

source: Enable/disable the two-step verification. Click <a href='@@setup-mobile-number'>here</a> to set it up or <a href='@@disable-two-step-verification'>here</a> to disable it.
de: 2-Faktor Authentifizierung ein- oder ausschalten. Klicken sie <a href='@@setup-mobile-number'>hier</a> um diese einzurichten oder <a href='@@disable-two-step-verification'>hier</a> um diese abzuschalten.

source: Enter code
de: Code eingeben

source: Enter the login code sent to your mobile number.
de: Geben Sie den Authentifizierungscode ein den wir an Ihre Handynummer verschickt haben.

source: Enter the verification code to activate two-step verification
de: Geben Sie den Verifizierungscode ein um die 2-Faktor Authentifizierung einzuschalten.

source: Enter the verification code you received on your mobile phone.
de: Geben Sie den Verifiezierungscode den Sie per SMS erhalten habe ein.

source: Enter your Twilio (phone) number.
de: Geben Sie Ihre Twilio (Telefon) Nummer ein.

source: Enter your Twilio AccountSID.
de: Geben Sie Ihre Twilio AccountSID ein.

source: Enter your Twilio AuthToken.
de: Geben Sie Ihren Twilio AuthToken ein.

source: Enter your mobile number to be used for two-step verification.
de: Geben Sie die Handynummer für die 2-Faktor Authentifizierung ein.

source: Enter your mobile phone number. Use the international format. <br/>Example Dutch number: +31699555555 <br/>Example International number: +49234555776
de: Geben Sie Ihre Handynummer ein. Benutzen Sie das internationale Format. <br/>Als Beispiel: +43664123123123

source: Enter your secret key for the site here. When choosing a secret key, think of it as some sort of a password.
de: Geben Sie hier einen geheimen Schlüssel ein, behandeln Sie diesen wie ein Passwort.

source: Enter your username for verification.
de: Geben Sie zur Verifizierung Ihren Benutzernamen an.

source: Forbidden for anonymous
de: Unzulässig für anonyme Benutzer

source: Globally enabled
de: Global eingeschaltet

source: If checked, globally enables the two-step verification for all users; otherwise - each user configures it himself. Note, that unchecking the checkbox does not disable the two-step verification for all users.
de: Wenn ausgewählt wird die 2-Faktor Authentifizierung global eingeschaltet, ansonsten kann jeder Benutzer diese selbst konfigurieren. Wenn Sie diese Auswahl aufheben wird die 2-Faktor Authentifizierung allerdings nicht für alle Benutzer abgeschaltet.

source: Important note
de: Wichtige Notiz

source: Invalid data. Details: {0}
de: Unbekannte Daten. Details: {0}

source: Invalid mobile number reset token
de: Ungültiger Zurücksetzungstoken

source: Invalid mobile number reset token.
de: Ungültiger Zurücksetzungstoken.

source: Invalid mobile number.
de: Falsche Handynummer.

source: Invalid token or token expired.
de: Falscher Token oder der Token ist abgelaufen.

source: Invalid username.
de: Falscher Benutzername.

source: Last authentication code
de: Letzter Authentifizierungscode

source: List of IPs user logged from
de: Liste mit IPs der aktiven Anmeldungen des Benutzers

source: Login failed
de: Anmeldung fehlgeschlagen

source: Mobile number
de: Handynummer

source: No token provided!
de: Kein Token angegeben.

source: Request for mobile number reset is failed! {0}
de: Die Anfrage für das zurücksetzen der Handynummer ist fehlgeschlagen! {0}

source: Request to (re)set the mobile number
de: Ihre Handynummer setzen/zurücksetzen

source: Request to reset the SMS Authenticator mobile number
de: Die Handynummer für die 2-Faktor Authentifizierung zurücksetzen.

source: Resend SMS
de: SMS Erneut senden

source: SMS Authenticator
de: SMS Anmeldung

source: SMS Authenticator configuration
de: SMS Anmeldungen Konfiguration

source: SMS verification code
de: SMS Verifizierungscode

source: Save
de: Speichern

source: Secret Key
de: Geheimer Schlüssel

source: Secret key
de: Geheimer Schlüssel

source: Security
de: Sicherheit

source: Setup failed! {0}
de: Einrichtung fehlgeschlagen! {0}

source: Setup mobile number for two-step verification
de: Handynummer für die 2-Faktor Authentifizierung einrichten

source: Setup two-step verification
de: 2-Faktor Authentifizierung einrichten

source: Show all user IPs
de: Alle Benutzer IPs anzeigen

source: Show unique user IPs
de: Eindeutige Benutzer IPs anzeigen

source: Submit
de: Abschicken

source: To setup two-step verification you need to enter your mobile phone numberto which you will be receiving SMS messages with login codes.
de: Um die 2-Faktor Authentifizierung einzurichten müssen Sie Ihre Handynummer eingegeben zu welcher Sie SMS Nachrichten mit Anmeldungscodes erhalten.‪

source: Token lifetime
de: Token Lebenszeit

source: Token to reset the mobile number
de: Token um die Handynummer zurückzusetzen

source: Twilio number
de: Twilio Nummer

source: Two-step verification
de: 2-Faktor Authentifizierung

source: Two-step verification is enabled for your account, but you haven't specified a mobile number yet! In order to be able to log in, you have to go through mobile number recovery procedure first.
de: Die 2-Faktor Authentifizierung ist für Ihr Konto eingeschaltet aber Sie haben noch keine Handynummer angegeben! Um sich anzumelden müssen Sie zuerst Ihre Handynummer setzen.

source: Two-step verification is successfully enabled for your account.
de: Die 2-Faktor Authentifizierung wurde für Ihren Account erfolgreich eingeschaltet.

source: Two-step verification will be ommit for users that log in from white listed addresses.
de: Die 2-Faktor Authentifizierung wird für mit folgenden IP Adressen abgeschaltet.

source: Unique user IPs
de: Eindeutige Benutzer IPs

source: Use the form below to (re)set your mobile phone number.
de: Benutzen Sie dieses Formular um Ihre Handynummer zu setzen/zurückzusetzen.

source: Use this code to confirm your mobile phone reset: ${code}
de: Benutzen Sie diesen Code um die Änderung zu bestätigen: ${code}

source: Use this code to confirm your mobile phone setup: ${code}
de: Benutzen Sie diesen Code um die Einrichtung abzuschliessen: ${code}

source: Use this code to login: ${code}
de: Benutzen Sie diesen Code um sich anzumelden: ${code}

source: User
de: Benutzer

source: User not found {0}.
de: Benutzer {0} nicht gefunden.

source: Username
de: Benutzername

source: Users' mobile number
de: Die Handynummer des Benutzer's

source: Verify
de: Überprüfen

source: Welcome! You are now logged in.
de: Willkommen! Sie sind nun angemeldet.

source: White-listed IP addresses
de: IP Adressen ohne 2-Faktor authentifizierung

source: You have received (or will shortly receive) an SMS with an verification code. <br/>After successfully submitting this form, you will be automatically logged in.
de: Sie haben (oder werden in kürze) einen SMS Verifizierungscode erhalten. <br/> Nachdem Sie dieses Formular abgeschickt haben werden Sie automatisch eingeloggt.

source: You have successfully changed/set your mobile number. You're now logged in.
de: Sie haben die Handynummer erfolgreich gesetzt.

source: You have successfully disabled the two-step verification for all users.
de: Sie haben die 2-Faktor Authentifizierung erfolgreich für alle Benutzer abgeschaltet.

source: You have successfully disabled the two-step verification for your account.
de: Die 2-Faktor Authentifizierung wurde für Ihr Konto erfolgreich abgeschaltet.

source: You have successfully enabled the two-step verification for all users.
de: Die 2-Faktor Authentifizierung wurde erfolgreich für alle Benutzer eingeschaltet.

source: You should have received an SMS message to the mobile number specified. Please, enter the code below.
de: Sie sollten eine SMS Nachricht an die angegeben Handynummer erhalten haben. Bitte geben Sie den Code unten ein.

source: Your SMS has just been resent.
de: Ihr SMS wurde erneut verschickt.

source: token_field_description
de: Geben Sie den Anmeldungscode den Sie per SMS erhalten haben ein. Wenn Sie Ihre Handynummer verloren haben klicken Sie bitte <a href='${absolute_url}/@@request-mobile-number-reset'>hier</a>. Wenn Sie keine SMS erhalten haben klicken Sie bitte auf den "SMS Erneut senden" Knopf unten.
