Repository: pypi-data/pypi-mirror-20
Catalog: packages/collective.googleanalytics/collective.googleanalytics-1.6.0.tar.gz/collective.googleanalytics-1.6.0/src/collective/googleanalytics/locales/*/LC_MESSAGES/collective.googleanalytics.po
Languages: es

source: Access your project, and go to APIs & auth entry
es: Acceda a su proyecto, y vaya a "APIs & auth"

source: An error occurred while rendering
es: Se ha producido un error durante la renderización

source: Authorization failed. Google Analytics for Plone received an invalid token.
es: Error de autorización. Google Analytics para Plone recibido un token válido.

source: Authorization required
es: Autorización requerida

source: Authorization revoked. You may now reauthorize with a different Google account.
es: Autorización revocada. Ahora puede volver a autorizar a una cuenta de Google diferente.

source: Authorization succeeded. You may now configure Google Analytics for Plone.
es: Autorización sucedió. Ahora puede configurar Google Analytics para Plone.

source: Authorize with Google
es: Autorizar con Google

source: Authorized:
es: Autorizado:

source: Before you can use Google Analytics for Plone, you need to authorize this site to access your Google Analytics account. Follow the steps below to complete the authorization process.
es: Antes de utilizar Google Analytics para Plone, debe autorizar a este sitio para acceder a su cuenta de Google Analytics. Siga los siguientes pasos para completar el proceso de autorización.

source: Cache interval
es: Intervalo de cache

source: Choose the Web property profile from Google Analytics.
es: Seleccione el perfil de la propiedad Web desde Google Analytics.

source: Choose the reports to display.
es: Seleccione los repostes a mostrar.

source: Choose the roles that should be excluded from tracking.
es: Selecciones los roles de usuario que deberían ser excluidos del seguimiento.

source: Choose which tracking plugins to use.
es: Seleccione cual complemento de seguimiento a usar.

source: Click "Create Client ID"
es: Click en "Create Client ID"

source: Click the "Credentials" menu entry under "APIs & auth"
es: Click en el sub menú "Credentials", dentro de "APIs & auth"

source: Click the "Credentials" menu entry under "APIs & auth", and click "Create new client ID"
es: Click en el sub menú "Credentials", dentro de "APIs & auth", y luego en "Create new client ID"

source: Displays a table of the top five next pages.
es: Muestra una tabla de los principales cinco páginas siguientes.

source: Displays a table of the top five previous pages.
es: Muestra una tabla de los cinco principales páginas anteriores.

source: Displays a table of the top pages by number of page views for this month.
es: Muestra una tabla de las páginas principales por número de páginas vistas de este mes.

source: Displays a table of the top source domains by number of visits.
es: Muestra una tabla de los dominios de origen principales en número de visitas.

source: Displays a table of the top source domains for this page.
es: Muestra una tabla de los dominios de origen principales de esta página.

source: Displays a table of the top ten keywords.
es: Muestra una tabla de las diez principales palabras clave.

source: Displays the average time on page for the last 30 days as a sparkline.
es: Muestra el promedio de tiempo en la página en los últimos 30 días como sparkline.

source: Displays the average time on site as a line graph.
es: Muestra el tiempo promedio en el sitio, un gráfico de líneas.

source: Displays the number of page views as a sparkline.
es: Muestra el número de páginas vistas como sparkline.

source: Displays the number of site page views as a line graph.
es: Muestra el número de página del sitio ve como un gráfico de líneas.

source: Displays the number of site unique visitors as a line graph.
es: Muestra el número de visitantes únicos del sitio como un gráfico de líneas.

source: Displays the number of site visits as a line graph.
es: Muestra el número de visitas del sitio como un gráfico de líneas.

source: Enter below
es: Ingrese aquí

source: Enter the number of minutes for which account information and report results should be cached.
es: Introduzca el número de minutos que da información de la cuenta y el reporte deben ser cacheados.

source: Enter the title of the portlet.
es: Introduzca el título del portlet.

source: Excluded Roles
es: Roles de usuarios excluidos

source: Generate Authentication URL
es: Generar URL de autenticación

source: Go to the ${google_developers_console} and create a Project, if you haven't already.
es: Diríjase a ${google_developers_console} y cree un nuevo proyecto, en caso que no lo haya hecho todavía.

source: Go to the ${google_developers_console} and go to your Project.
es: Diríjase a ${google_developers_console} y haga click en su proyecto.

source: Google Analytics Settings
es: Configuraciones de Google Analytics

source: Google Analytics control panel
es: Panel de control Google Analytics

source: If you already have your Project and OAuth credentials, follow these steps
es: Si ya tiene su proyecto y las credenciales OAuth, siga estos pasos

source: If you haven't created a project and obtained an OAuth key and secret from Google, follow these steps.
es: Si no ha creado un proyecto y obtenido sus claves OAuth de Google, siga estos pasos.

source: Last 30 Days
es: Últimos 30 Días

source: Make sure "Analytics API" is enabled
es: Asegúrese que "Analytics API" se encuentra activada

source: Make sure to also include "http" and "https", if needed.
es: Asegúrese de también incluir "http" y "https", según corresponda.

source: Make sure you include "http" and "https", if needed.
es: Asegúrese de también incluir "http" y "https", según corresponda.

source: More analytics
es: Mas estadísticas

source: Page Views: Sparkline
es: Vistas de Página: Sparkline

source: Plugins
es: Complementos

source: Profile
es: Perfil

source: Report Categories
es: Categorías de Reporte

source: Reports
es: Reporte

source: Reports Profile
es: Perfil de Reportes

source: Results
es: Resultados

source: Revoke access
es: Revocar acceso

source: Site Page Views: Line Chart
es: Página Vistas del Sitio: Gráfico de líneas

source: Site Unique Visitors: Line Chart
es: Visitantes únicos del Sitio: Gráfico de líneas

source: Site Visits: Line Chart
es: Visitas del sitio: Gráfico de líneas

source: The report
es: El reporte

source: The request to Google Analytics timed out. Please try again later.
es: La solicitud a Google Analytics supero el tiempo de espera. Por favor, inténtelo otra ves mas tarde.

source: Time on Page: Sparkline
es: Tiempo en Página: Sparkline

source: Time on Site: Line Chart
es: Tiempo en el sitio: Gráfico de líneas

source: Title
es: Título

source: Top 10 Keywords: Table
es: Las 10 primeras Palabras clave: Tabla

source: Top 10 Page Sources: Table
es: Las 10 primeras fuentes de Página: Tabla

source: Top 5 Next Pages: Table
es: Las 5 primeras Páginas próximas: Tabla

source: Top 5 Pages: Table
es: Las 5 primeras Páginas: Tabla

source: Top 5 Previous Pages: Table
es: Las 5 primeras Páginas previas: Tabla

source: Top 5 Sources: Table
es: Las 5 primeras fuentes: Tabla

source: Tracking Profile
es: Perfil de seguimiento

source: Under "Application type" choose "Web application"
es: En "Application type" escoja "Web application"

source: Under "Authorized JavaScript origins" add your domains, such as:
es: En "Authorized JavaScript origins" agregue sus dominios, como por ejemplo:

source: Under "Authorized redirect URI" add this URL:
es: En "Authorized redirect URI" agregue esta URL:

source: Visit Google Analytics
es: Visite Google Analytics

source: You can now
es: Ahora puede

source: You have enabled the tracking feature of this product, but it looks like you still have tracking code in the Site control panel. Please remove any Google Analytics tracking code from the Site control panel to avoid conflicts.'
es: Ha activado la opción de rastreo en este producto, pero parece que ya posee el código de rastreo en el panel de control. Por favor elimine el código de rastreo de Google Analytics desde el panel de control para evitar conflictos.

source: You need to authorize with Google in the
es: Usted necesita a autorizar a Google en el

source: analytics_assignment
es: Reportes

source: analytics_assignment_description
es: Configurar los reportes que serán mostrados en el panel de control de Google Analytics.

source: analytics_settings
es: Configuraciones

source: analytics_settings_description
es: Configurar las configuraciones del producto Google Analytics.

source: analytics_tracking
es: Seguimiento

source: analytics_tracking_description
es: Configurar la forma de las estadísticas de seguimiento de Google Analytics acerca este sitio.

source: did not return any results
es: no arrojó ningún resultado
