Repository: pypi-data/pypi-mirror-20
Catalog: packages/ishtar/ishtar-0.99.13.1.tar.gz/ishtar-0.99.13.1/translations/*/archaeological_operations.po
Languages: fr

source: Parcels
fr: Parcelles

source: Town
fr: Commune

source: Year
fr: Année

source: Parcel number
fr: Numéro de parcelle

source: Public domain
fr: Domaine public

source: Town section is required.
fr: Vous devez renseigner la section.

source: public domain
fr: domaine public

source: Current parcels
fr: Parcelles actuelles

source: Deleted parcels
fr: Parcelles supprimées

source: Full text input
fr: Saisie libre

source: example: "2013: XD:1 to 13,24,33 to 39, YD:24" or "AB:24,AC:42"
fr: exemple : "2013: XD:1 à 13,24,33 à 39, YD:24" ou "AB:24,AC:42"

source: There are identical parcels.
fr: Il y a des parcelles identiques.

source: Relation type
fr: Type de relation

source: Operation
fr: Opération

source: You should select an operation.
fr: Vous devez sélectionner une opération.

source: You should select a relation type.
fr: Vous devez sélectionner un type de relation.

source: Current relations
fr: Relations actuelles

source: Deleted relations
fr: Relations supprimées

source: Numeric reference
fr: Identifiant numérique

source: Parcel (section/number/public domain)
fr: Parcelle (section/numéro/domaine public)

source: Department
fr: Département

source: Name
fr: Nom

source: Operation type
fr: Type d'opération

source: Is open?
fr: Est ouvert ?

source: In charge
fr: Responsable du suivi scientifique

source: Scientist in charge
fr: Responsable scientifique

source: Operator
fr: Opérateur

source: Remains
fr: Vestiges

source: Periods
fr: Périodes

source: Started before
fr: Commencé avant

source: Started after
fr: Commencé après

source: Ended before
fr: Terminé avant

source: Ended after
fr: Terminé après

source: Search within relations
fr: Rechercher parmi les relations

source: Comment
fr: Commentaire

source: Abstract (full text search)
fr: Résumé (recherche texte intégral)

source: Comment about scientific documentation
fr: Commentaire concernant la documentation scientifique

source: Record quality
fr: Qualité d'enregistrement

source: Report processing
fr: Traitement du rapport

source: Virtual operation
fr: Opération virtuelle

source: Archaeological site
fr: Entité archéologique

source: Created by
fr: Créé par

source: Modified by
fr: Modifié par

source: Documentation deadline before
fr: Date limite de rendu de la documentation avant

source: Documentation deadline after
fr: Date limite de rendu de la documentation après

source: Documentation received
fr: Documentation reçue

source: Finds deadline before
fr: Date limite de rendu du mobilier avant

source: Finds deadline after
fr: Date limite de rendu du mobilier après

source: Finds received
fr: Mobilier reçu

source: Operation search
fr: Rechercher une opération

source: Associated file
fr: Dossier associé

source: Archaeological file
fr: Dossier archéologique

source: Abstract
fr: Résumé

source: months
fr: mois

source: years
fr: années

source: Creation date
fr: Date de création

source: Start of field work
fr: Début du travail de terrain

source: All
fr: Tout

source: Preventive
fr: Préventif

source: Research
fr: Programmé

source: Slicing
fr: Découpage

source: Department detail
fr: Détail par département

source: Date get from
fr: Date obtenue depuis

source: Preventive/Research
fr: Préventif/Programmé

source: Date after
fr: Date après

source: Date before
fr: Date avant

source: With reports
fr: Avec un rapport

source: With finds
fr: Avec du mobilier

source: General
fr: Général

source: Generic name
fr: Nom générique

source: Old code
fr: Ancien code

source: Head scientist
fr: Responsable scientifique

source: Operator reference
fr: Référence de l'opérateur

source: Total surface (m2)
fr: Surface totale (m2)

source: Start date
fr: Date de début

source: Excavation end date
fr: Date de fin de chantier

source: Report delivery date
fr: Date de livraison du rapport

source: Deadline for submission of the documentation
fr: Date limite de rendu de la documentation

source: Deadline for submission of the finds
fr: Date limite de rendu du mobilier

source: <p>Heavy images are resized to: %(width)dx%(height)d (ratio is preserved).</p>
fr: <p>Les images trop grandes sont retaillées en : %(width)dx%(height)d (le ratio est conservé).</p>

source: If you want to set an excavation end date you have to provide a start date.
fr: Avant de renseigner la date de fin de chantier, il est nécessaire de renseigner une date de début.

source: The excavation end date cannot be before the start date.
fr: La date de fin de chantier ne peut être antérieure à la date de début.

source: Operation code already exists for year: %(year)d - use a value bigger than %(last_val)d
fr: Ce code d'opération existe déjà pour l'année %(year)d - utilisez une valeur plus grande que %(last_val)d

source: Bad operation code
fr: Mauvais code d'opération

source: Operation code
fr: Code de l'opération

source: Preventive informations - excavation
fr: Information archéologie préventive - fouille

source: Cost (euros)
fr: Coût (euros)

source: Scheduled man-days
fr: Jours-hommes prévus

source: Optional man-days
fr: Jours-hommes optionnels

source: Effective man-days
fr: Jours-hommes effectifs

source: Preventive informations - diagnostic
fr: Information archéologie préventive - diagnostic

source: Prescription on zoning
fr: Prescription sur zonage

source: Prescription on large area
fr: Prescription sur une vaste surface

source: Prescription on geoarchaeological context
fr: Prescription sur un contexte géoarchéologique

source: Towns
fr: Communes

source: Parcel
fr: Parcelle

source: Remain types
fr: Types de vestige

source: Remain type
fr: Type de vestige

source: Period
fr: Période

source: Reference
fr: Référence

source: This reference already exists.
fr: Cette référence existe déjà.

source: Archaeological sites
fr: Entités archéologiques

source: Associated archaeological sites
fr: Entités archéologiques associées

source: Search
fr: Recherche

source: Would you like to close this operation?
fr: Voulez-vous clore cette opération ?

source: Would you like to delete this operation?
fr: Voulez-vous supprimer cette opération ?

source: Index already exists for operation: %(operation)s - use a value bigger than %(last_val)d
fr: Cet index existe déjà pour l'opération : %(operation)s, utilisez une valeur plus grande que %(last_val)d

source: Operation's year
fr: Année de l'opération

source: Operation's town
fr: Commune de l'opération

source: Documentation search
fr: Rechercher une documentation

source: You should select a document.
fr: Vous devez sélectionner un document.

source: Act type
fr: Type d'acte

source: Indexed?
fr: Indexé ?

source: Object
fr: Objet

source: Administrative act search
fr: Rechercher un acte administratif

source: You should select an administrative act.
fr: Vous devez sélectionner un acte administratif.

source: Signature date
fr: Date de signature

source: This index already exists for year: %(year)d - use a value bigger than %(last_val)d
fr: Cet index existe déjà pour l'année : %(year)d, utilisez une valeur plus grande que %(last_val)d

source: Bad index
fr: Mauvais index

source: Would you like to delete this administrative act?
fr: Voulez-vous supprimer cet acte administratif ?

source: Template
fr: Patron

source: This document is not intended for this type of act.
fr: Ce document n'est pas destiné à ce type d'acte.

source: Doc generation
fr: Génération de document

source: Generate the associated doc?
fr: Générer le document associé ?

# admin act register
source: Register
fr: Registre

source: Creation
fr: Ajout

source: Closing
fr: Clôture

source: Deletion
fr: Suppression

source: Administrative act
fr: Acte administratif

source: Administrative Act
fr: Acte administratif

source: Dashboard
fr: Tableau de bord

source: General informations
fr: Informations générales

source: Operations
fr: Opérations

source: Order
fr: Ordre

source: End date
fr: Date de fin

source: Parent period
fr: Période parente

source: Type Period
fr: Type de période

source: Types Period
fr: Types de période

source: Type of report state
fr: Type d'état de rapport

source: Types of report state
fr: Types d'état de rapport

source: Can view all Archaeological sites
fr: Peut voir toutes les Entités archéologiques

source: Can view own Archaeological site
fr: Peut voir ses propres Entités archéologiques

source: Can add own Archaeological site
fr: Peut ajouter ses propres Entités archéologique

source: Can change own Archaeological site
fr: Peut modifier sa propre Entité archéologique

source: Can delete own Archaeological site
fr: Peut supprimer ses propres Entités archéologiques

source: Not documented
fr: Non documenté

source: Arbitrary
fr: Arbitraire

source: Reliable
fr: Fiable

source: Year - Index
fr: Année - Index

source: Associated file (label)
fr: Dossier associé (nom)

source: Operator name
fr: Nom de l'opérateur

source: Scientist (full name)
fr: Responsable scientifique (nom complet)

source: Associated file (external ID)
fr: Dossier associé (identifiant externe)

source: Scientist (title)
fr: Responsable scientifique (titre)

source: Scientist (surname)
fr: Responsable scientifique (nom)

source: Scientist (name)
fr: Scientifique (nom)

source: Scientist - Organization (name)
fr: Scientifique - Organisation (nom)

source: In charge (title)
fr: Responsable du suivi scientifique (titre)

source: In charge (surname)
fr: Responsable du suivi scientifique (prénom)

source: In charge (name)
fr: Responsable du suivi scientifique (nom)

source: In charge - Organization (name)
fr: Responsable du suivi scientifique - Organisation (nom)

source: Archaeological sites (reference)
fr: Entités archéologiques (référence)

source: Closing date
fr: Date de clôture

source: In charge scientist
fr: Responsable du suivi scientifique

source: File
fr: Dossier

source: General comment
fr: Commentaire général

source: Cached name
fr: Nom en cache

source: If checked, it means that this operation have not been officialy registered.
fr: Si coché, cela signifie que cette opération n'a pas été officiellement enregistrée.

source: Multi polygon
fr: Polygones multi-parties

source: Can view all Operations
fr: Peut voir toutes les Opérations

source: Can view own Operation
fr: Peut voir sa propre Opération

source: Can add own Operation
fr: Peut ajouter sa propre Opération

source: Can change own Operation
fr: Peut modifier sa propre Opération

source: Can delete own Operation
fr: Peut supprimer sa propre Opération

source: Can close Operation
fr: Peut clore une Opération

source: This operation code already exists for this year
fr: Ce code d'opération existe déjà pour cette année.

source: Number of parcels
fr: Nombre de parcelles

source: Number of administrative acts
fr: Nombre d'actes administratifs

source: Number of indexed administrative acts
fr: Nombre d'actes administratifs indexés

source: Number of context records
fr: Nombre d'Unités d'Enregistrement

source: Number of finds
fr: Nombre d'éléments de mobilier

source: No type
fr: Pas de type

source: Number of sources
fr: Nombre de documents

source: Mean
fr: Moyenne

source: Inverse relation
fr: Relation inverse

source: Operation relation type
fr: Type de relation entre opérations

source: Operation relation types
fr: Types de relation entre opérations

source: Operation record relation
fr: Relation entre opérations

source: Operation record relations
fr: Relations entre opérations

source: Operation documentation
fr: Documentation d'une opération

source: Operation documentations
fr: Documentations des opérations

source: Can view all Operation sources
fr: Peut voir toutes les Documentations d'opération

source: Can view own Operation source
fr: Peut voir sa propre Documentation d'opération

source: Can add own Operation source
fr: Peut ajouter sa propre Documentation d'opération

source: Can change own Operation source
fr: Peut modifier sa propre Documentation d'opération

source: Can delete own Operation source
fr: Peut supprimer sa propre Documentation d'opération

source: Treatment request
fr: Demande de traitement

source: Treatment
fr: Traitement

source: Intended to
fr: Destiné à

source: Associated template
fr: Patron associé

source: Indexed
fr: Indexé

source: Act types
fr: Types d'acte

source: Person in charge of the operation
fr: Responsable d'opération

source: Archaeological preventive operator
fr: Opérateur d'archéologie préventive

source: Signatory
fr: Signataire

source: Departments
fr: Départements

source: Cached values get from associated departments
fr: Valeur en cache des départements associés

source: Cached values get from associated towns
fr: Valeur en cache des communes associées

source: Administrative acts
fr: Actes administratifs

source: Can view all Administrative acts
fr: Peut voir tous les Actes administratifs

source: Can view own Administrative act
fr: Peut voir son propre Acte administratif

source: Can add own Administrative act
fr: Peut ajouter son propre Acte administratif

source: Can change own Administrative act
fr: Peut modifier son propre Acte administratif

source: Can delete own Administrative act
fr: Peut supprimer son propre Acte administratif

source: Ref.
fr: Réf.

source: This index already exists for this year
fr: Cet index existe déjà pour cette année.

source: External ID
fr: ID externe

source: External ID is set automatically
fr: L'identifiant externe est configuré automatiquement

source: Address - Locality
fr: Adresse - Lieu-dit

source: Owner
fr: Propriétaire

source: Parcel owner
fr: Propriétaire de parcelle

source: Parcel owners
fr: Propriétaires de parcelle

source: Recorded
fr: Enregistré

source: Effective
fr: Effectif

source: Active
fr: Actif

source: Field completed
fr: Terrain achevé

source: Associated report
fr: Rapport associé

source: Closed
fr: Clos

source: Documented and closed
fr: Documenté et clos

source: Is preventive
fr: Préventif

source: Operation type old
fr: Type d'opération - ancien

source: Operation types old
fr: Types d'opération - ancien

source: New operation
fr: Ajouter une opération

source: Operation modification
fr: Modifier une opération

source: Operation closing
fr: Clôturer une opération

source: Operation deletion
fr: Supprimer une opération

source: Operation: source search
fr: Opération : rechercher une documentation associée

source: Operation: source creation
fr: Opération : ajouter une documentation associée

source: Operation: source modification
fr: Opération : modifier une documentation associée

source: Operation: source deletion
fr: Opération : supprimer une documentation associée

source: Operation: new administrative act
fr: Opération : ajouter un acte administratif

source: Operation: administrative act modification
fr: Opération : modification d'un acte administratif

source: Operation: administrative act deletion
fr: Opération : supprimer un acte administratif

source: Add
fr: Ajouter

source: Warning: No Archaeological File is provided. If you have forget it return to the first step.
fr: Attention : Aucun dossier archéologique n'a été précisé. S'il s'agit d'un oubli, définissez-le à la première étape.

source: This operation is virtual.
fr: Cette opération est virtuelle.

source: Patriarche OA code not yet recorded!
fr: Code d'opération Patriarche non renseigné !

source: Last modification date:
fr: Dernière date de modification :

source: State:
fr: État :

source: Active file
fr: Dossier actif

source: Closed operation
fr: Opération close

source: Closing date:
fr: Date de clôture :

source: by
fr: par

source: Cost:
fr: Coût :

source: Duration:
fr: Durée :

source: Day
fr: Jour

source: Associated parcels
fr: Parcelles associées

source: Document from this operation
fr: Documents de cette opération

source: Context records
fr: Unités d'Enregistrement

source: Context record relations
fr: Relations entre Unités d'Enregistrement

source: Documents from associated context records
fr: Documents des Unités d'Enregistrement associées

source: Finds
fr: Mobilier

source: Documents from associated finds
fr: Documents du mobilier associé

source: Statistics
fr: Statistiques

source: Number
fr: Nombre

source: Material type
fr: Type de matériau

source: Object type
fr: Type d'objet

source: Sources
fr: Documents

source: Finds by context records
fr: Mobilier par Unités d'Enregistrement

source: Operation source
fr: Documentation associée à l'opération

source: No administrative act associated
fr: Aucun acte administratif associé

source: No archaeological site associated
fr: Pas d'entité archéologique associée

source: No parcel
fr: Pas de parcelle

source: Global informations
fr: Informations générales

source: Status
fr: État

source: area by type of operation
fr: surface par type d'opération

source: Area (ha)
fr: Surface (ha)

source: by types
fr: par types

source: State
fr: État

source: by year
fr: par année

source: by realisation year
fr: par année de réalisation

source: effective operation by type and year
fr: opérations effectives par type et année

source: by realisation month
fr: par mois de réalisation

source: Survey informations
fr: Informations : diagnostics

source: current year
fr: année en cours

source: Area
fr: Surface

source: Man-day
fr: Jour-homme

source: Man-day/hectare
fr: Jour-homme/hectare

source: Man-day/hectare for effective operations (current year):
fr: Jour-homme/hectare pour les opérations effectives (année en cours) :

source: organizations (current year)
fr: organisations (année en cours)

source: current realisation year
fr: année de réalisation en cours

source: Man-day/hectare for effective operations (current realisation year):
fr: Jour-homme/hectare pour les opérations effectives (année de réalisation en cours) :

source: organizations (current realisation year)
fr: organisations (année de réalisation en cours)

source: area by organization by year
fr: surface par organisation et par année

source: Organization
fr: Organisation

source: effective operations areas (ha)
fr: surface des opérations effectives (ha)

source: Sum
fr: Somme

source: Average
fr: Moyenne

source: man-days/hectare by year
fr: jours-homme/hectare par année

source: Man-Days/hectare
fr: Jours-homme/hectare

source: by month
fr: par mois

source: by department
fr: par département

source: effective operation by department
fr: opérations effectives par département

source: main towns by number
fr: communes principales en nombre

source: main towns by surface
fr: communes principales en surface

source: Total surface (ha)
fr: Surface totale des terrains (ha)

source: Excavation informations
fr: Fouilles : informations

source: area by organization by realisation year
fr: surface par organisation et par année de réalisation

source: Cost
fr: Coût

source: FNAP cost
fr: Coût FNAP

source: main towns by cost
fr: communes principales par coût

source: This act is indexed!
fr: Cet acte est indexé !
